# Create Method (Document, ElementId, IList(CurveLoop), IList(XYZ), IList(Int32), IList(Int32), AreaLoadType)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..Create Method (Document, ElementId, IList<(Of <(<'CurveLoop>)>)>, IList<(Of <(<'XYZ>)>)>, IList<(Of <(<'Int32>)>)>, IList<(Of <(<'Int32>)>)>, AreaLoadType)
AreaLoad Class See Also
---
Creates a new custom area load within the project.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static AreaLoad Create(
	Document document,
	ElementId hostElemId,
	IList<CurveLoop> loops,
	IList<XYZ> forceVectors,
	IList<int> refPointCurveIndexes,
	IList<int> refPointCurveEnds,
	AreaLoadType symbol
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	hostElemId As ElementId, _
	loops As IList(Of CurveLoop), _
	forceVectors As IList(Of XYZ), _
	refPointCurveIndexes As IList(Of Integer), _
	refPointCurveEnds As IList(Of Integer), _
	symbol As AreaLoadType _
) As AreaLoad
```

Visual C++
---
```text
public:
static AreaLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	IList<CurveLoop^>^ loops,
	IList<XYZ^>^ forceVectors,
	IList<int>^ refPointCurveIndexes,
	IList<int>^ refPointCurveEnds,
	AreaLoadType^ symbol
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document to which new area load will be added.
hostElemId
    Type: Autodesk.Revit.DB..::..ElementId The analytical surface host element id for the area Load.
loops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> The loops that define geometry of the area load. The curve loop collection should contains a closed loops consisting of lines.
forceVectors
    Type: System.Collections.Generic..::..IList<(Of <(<'XYZ>)>)> The array of force vectors applied to the maximum three reference point of the area load.
refPointCurveIndexes
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> The array of maximum three curve indexes on which reference points should be placed on.
refPointCurveEnds
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> The array of maximum three curve ends indicating where reference points should be placed on. The array can have only 0 or 1 values, which means 0 - curve start point, 1 - curve end point.
symbol
    Type: Autodesk.Revit.DB.Structure..::..AreaLoadType The symbol of the AreaLoad. Set nullNothingnullptra null reference (Nothing in Visual Basic) to use default type.
# ### Return Value
If successful, returns an object of the newly created AreaLoad. nullNothingnullptra null reference (Nothing in Visual Basic) is returned if the operation fails.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | hostElemId is not permitted for this type of load. -or- One of the following requirements is not satisfied : \- curve loops loops are not planar \- curve loops loops are self-intersecting \- curve loops loops contains zero length curves -or- Thrown when force vector is equal zero. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | Thrown if the host element id is a Curved Panel. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if type could not be set for newly created area load. |

# See Also
AreaLoad Class
Create Overload
Autodesk.Revit.DB.Structure Namespace